[
{"book_tile": "The Help", "author": "Kathryn Stockett", "reviews": ["I have this terrible, dreary feeling in my diaphragm area this morning, and I’m not positive what it’s about, but I blame some of it on this book, which I am not going to finish. I have a friend who is mad at me right now for liking stupid stuff, but the thing is that I do like stupid stuff sometimes, and I think it would be really boring to only like smart things. What I don’t like is when smart (or even middle-brained) writers take an important topic and make it petty through guessing about what they don’t know. I can list you any number of these writers who would be fine if they weren't reaching into topics about which they have no personal experience (incidentally, all writers I'm pretty sure my angry friend loves. For example, The Lovely Bones, The Kite Runner, Water for Elephants, Memoirs of a Geisha, etc.). These are the books for which I have no patience, topics that maybe someone with more imagination or self-awareness could have written about compassionately, without exploiting the victimization of the characters. They’re books that hide lazy writing behind a topic you can’t criticize. The Help is one of these.You’ve got this narrative telephone game in this book. The telephone game is pretty fun sometimes, and it is really beautiful in monster stories like Frankenstein and Wuthering Heights because what they are telling me is not intended as trustworthy or earnest. All of the seriousness in monster stories is an impression or an emotion reflected back through the layers of narrative. I don’t feel that way about the topic of The Help, though. In this book, a white woman writes from the point of view of a black woman during the Civil Rights movement, who overhears the conversations of white women. It's an important topic, and I don't want to hear it through untrustworthy narrators.So, I can basically get on board with the dialect of the black maids, but what throws me off as a reader is when the black maid is quoting the white women and they’re all speaking perfect English without a trace of an accent. It becomes particularly weird when one of the black maids starts to comment on the extreme accent of one of the white women, Celia Foote, whose written dialogue continues to be impeccable. Who is this narrator? Why does she choose not to speak proper English if she can speak it? Why does she choose to give proper English to someone else who she has told me doesn't speak it? Also, usually the layers of narration in a telephone-game book are only within the book. In this case, it’s the author’s voice stabbing through the story. I am convinced it is her whose brain hears the white woman speaking TV English, and the black women speaking in dialect. It gives away the game. Even the quotes from the movie have an example of this. A conversation between her and Minnie goes like this:Celia Foote: They don't like me because of what they think I did.Minny Jackson: They don't like you 'cause they think you white trash. Celia speaks in a proper sentence, but Minny misses the \"are\" in the second part of the sentence. Celia says \"because,\" but Minny says \"'cause.\" If the reader were supposed to understand that Celia does not speak in dialect, that would make sense, but since it specifically states that she does, it doesn't make sense.To attempt to be clear, I didn't have a problem that the book was in dialect. I had a problem that the book said, \"This white woman speaks in an extreme dialect,\" and then wrote the woman's dialog not in dialect. Aerin points out in message 111 that I am talking about eye dialect, which is about spelling, not pronunciation, as in the example above. Everyone, in real life, speaks in some form of non-standard English. Though I have seen some really beautiful uses of eye dialect, as Aerin points out, writers typically use it to show subservience of characters or that they are uneducated, which often has racist overtones. If it troubles you that I'm saying this, and you would like to comment on this thread, you may want to read other comments because it is likely someone has already said what you are going to say.I’m not finishing this one, and it’s not because I think people shouldn’t like it, but rather because I’m almost 100 pages in and I can see the end, and it’s failed to engage me. When a few IRL friends have asked what I thought of the book and I said I didn't care for it, they have told me that I am taking it too seriously, that it is just a silly, fluff book, not a serious study of Civil Rights. Again, I don’t have a problem with stupid books, but when it’s a stupid book disguised as an Important Work of Cultural History, all I want to do the whole time is tear its mask off. And a book about Civil Rights is always important cultural history to me. Anyway, the book becomes unpleasant; I become unpleasant; it’s bad news. If you loved this book, though, (or, really, even if you hated it) I would recommend Coming of Age in Mississippi. I think that book is one of the more important records of American history. Plus, it’s beautifully written, inspirational, and shocking. It's been years since I read it, so I might be giving it an undeserved halo, but I can’t say enough good things about it.INDEX OF PROBLEMS WITH THIS REVIEW\"You should finish the book before you talk about it\": comment 150 (second paragraph); comments 198 and 199. “Stockett did experience the Civil Rights Era”: comment 154; comment 343.“The author of The Lovely Bones was raped”: comment 190.“The author of The Kite Runner is from Afghanistan”: comment 560.\"Memoirs of a Geisha is accurate and not comparable to The Help\": comment 574.“Don’t be so critical!”: comment 475.“Have you written a bestseller?”: comment 515.“Fiction doesn’t have to be a history lesson”: comments 157 through 162.“Having grown up in the South during this era and having had a maid, I could relate to the emotional nuances of this book”: comments 222 and 223.\"Minny and Aibileen are relatable\": comment 626“You are trying to silence authors”: comment 317 and comments 306 through 316.“Why do you want to read a Civil Rights book about racism and hatred? I would prefer one about friendship and working together”: comment 464.“Why are there so many votes for such a half-assed review?”: comment 534.“Authors can write outside of their personal experiences”: comments 569 through 587.", "I was uncomfortable with the tone of the book; I felt that the author played to very stereotypical themes, and gave the characters (especially the African American ones) very inappropriate and obvious voices and structure in terms constructing their mental character. I understand that the author wrote much of this as a result of her experiences growing up in the south in the 1960's, and that it may seem authentic to her, and that she was even trying to be respectful of the people and the time; but, ultimately, I thought that it was written from a very narrow, idealized, almost childish perspective of race relations without a true appreciation of the humanity and soul of the characters. And the ultimate theme & message (i.e. \"why, we're all the same - there's no difference between us after all!\") only reinforced my feeling that this is written from someone who has a very undeveloped or underdeveloped concept of race and race relations in the United States. The author would benefit from exploring authentic African American voices (Richard Wright, James Baldwin, Zora Neale Hurston, Langston Hughes, Toni Morrison, Alice Walker, Maya Angelou) and understanding the scope, range and (most important) the foundation of the emotions genuine African American characters express as a result of their journey as a people in the US (hope, frustration, drive, passion, anger, happiness, sadness, depression, joy). ", "I read the first paragraph of The Help, absorbing the words, but suddenly being caught off guard by the dialect. I stopped reading.I shifted the book in my hands, flipping to the author's biography and photograph on the back of the dust jacket. Staring up at me was this: [image error]Oh, sweet Jesus, I thought. An affluent, white Manhattanite. Great. And one who apparently fancies herself a master at Southern Black Vernacular. Even better.I rolled my eyes and returned to page one, fully prepared to hate every word on every page, beginning with Aibileen's horrifically stereotyped \"voice\" written by this smug White Lady. Look, I really don't subscribe to the belief that one must be a part of a culture in order to write effectively (or even stirringly) about or in the voice of that culture. Wally Lamb wrote convincingly as a twin in I Know This Much Is True (and as an identical twin, I can vouch for its authenticity). Nancy Farmer wove African culture beautifully into her science fiction novel The Ear, The Eye, and the Arm. Mark Haddon's Christopher Swinton character is a remarkable sketch of a child with autism. So clearly it can be done. But I was not convinced about Stockett.When Minnie's first chapter hopped along in The Help, I prepared myself for an unconvincing spin on Aibileen's narrative, a pasty twist of the vernacular that had been spewed out in the first paragraph. That is not what I got. Instead, her character was nothing like the other maid; her own voice was rendered in tough, bitter layers, providing a nice foil to Aibileen's complex struggle between resolve and resign. NO! my brain screamed. WHAT ARE YOU DOING?! DO NOT ENJOY THIS!But the pages turned, and when I next looked up at the clock, a few hours had passed and I was well on my way to the halfway point. Dammit.And this was the pattern that followed in the 2 1/2 days it took me to read The Help; I found myself loving it and hating it simultaneously, but leaning more to the Love side of the dilemma. There are countless trite episodes in The Help, standard plot fillers that can be found in both heaving Harlequin romances and sucky Oprah Book Club fodder. But there are more moments of striking beauty, humanity, and humor, even if the ending is a bit of a cop-out. (No surprise that The Rich White Lady Saves The Day And Gets What She Wants.)Is The Help Great Literature? No. Is it a fast and enjoyable read? Yes. It's also a fairly striking and genuine portrait of what life in the south was like during those tumultuous times. And for that... well, for that I quite liked it.So congratulations, Whitey McWhiterson, I wound up not hating your book. And God knows I tried.", "[image error]", "OK. Wow. Wipes Away Tears.The Help is a fictional story set in Mississippi in 1962. The perspective shifts between three characters: two black maids, Aibileen and Minnie, and a young white woman nicknamed Skeeter. Will these women be able to change the status quo and what will it cost them?First of all, the audiobook is phenomenal with a full cast of characters. It is definitely on my list of top 10 best audiobooks of all time. Second, this book made me laugh and cry. It has a very conversational tone similar to Project Hail Mary but with no science and women instead of men. When the story rang out across my living room, I felt fully immersed in the story, just like Aibileen was sitting on the edge of my couch sharing her story. This was one of those books where you hoped that it wouldn’t come to an end.The characters are unforgettable, complex, and imperfect. This book was incredibly fascinating because the stakes were so high for the maids. At any time if their employers were unhappy for any reason, they could be fired. Not only would they be unemployed, but no one would hire them with a bad reference especially in a small town. However, I think the title, The Help, is has more than one meaning. The plot was intricately woven together, and it felt realistic. At the end, I googled, “Is the Help based on a true story?” Apparently, this question is quite common. Based on my Google research, the author was sued by her brother’s maid, Ablene Cooper, for using her likeness.This book tackles meaningful issues such as racial injustice, rejection, and being on the outside of a clique, fear. But it also covered love, hope, bravery, and children, the future. It was really a very beautiful book, and I am grateful for reading it. This will be a strong contender for book of the year.2023 Reading ScheduleJan Alice in WonderlandFeb Notes from a Small IslandMar Cloud AtlasApr On the RoadMay The Color PurpleJun Bleak HouseJul Bridget Jones’s DiaryAug Anna KareninaSep The Secret HistoryOct Brave New WorldNov A Confederacy of DuncesDec The Count of Monte CristoConnect With Me!Blog Twitter BookTube Facebook Insta", "While it was a well-written effort, I didn't find it as breathtaking as the rest of the world. It more or less rubbed me the wrong way. It reads like the musings of a white woman attempting to have an uncomfortable conversation, without really wanting to be uncomfortable. It's incredibly hard to write with integrity about race and be completely honest and vulnerable. The author failed to make me believe she was doing anything beyond a show & tell. And if her intent isn't anything greater, then it makes this book all the more pandering to the white imagination of what it must have been like to be \"the help\" during that era. It's passive self-reflection at best and utterly useless.The national fascination with this book makes me sick. It makes me think of my grandmother who was \"the help\" to many white families for well over 50 years. Her stories aren't too different from those told in this book, but they are hers to tell. If she were alive today, I don't believe she would praise Stockett's book. In fact, I think she we would be horrified at the thought that her years of hard work (in some cases, for some very horrible people) would be reduced to some wannabe feel good story of the past. ", "Here is an illustrative tale of what it was like to be a black maid during the civil rights movement of the 1960s in racially conflicted Mississippi. There is such deep history in the black/white relationship and this story beautifully shows the complex spectrum, not only the hate, abuse, mistrust, but the love, attachment, dependence. Stockett includes this quote by Howell Raines in her personal except at the end of the novel: There is no trickier subject for a writer from the South than that of affection between a black person and a white one in the unequal world of segregation. For the dishonesty upon which a society is founded makes every emotion suspect, makes it impossible to know whether what flowed between two people was honest feeling or pity or pragmatism. An eloquent way to describe Stockett's intentions for this novel. I know most reviews will probably focus on the racial relationships in the book, but to me the most haunting statement was that when you are paying someone to care for you and their livelihood depends on making you happy, you can't expect an honest relationship. I did not expect this book to hit so close to home. After all, I did not grow up in the South and completely missed the racial mind shift in the country. But the book isn't just about racism and civil rights. It's about the employer relationship too. And I did grow up in South America with a maid trying to keep herself out of poverty by making our crazy family happy. As much as we loved her, I can see so many of the pitfalls from these complex relationships in my own history. I know our maid was stuck between pleasing my mother and raising us the way she believed appropriate. I know it was physically hard to work from sunup to late everyday and emotionally hard to never relax because she wasn't the decision maker of our home and at any moment she could be reprimanded for making the wrong decision. She had absolutely no power, and yet she was all powerful to shape and mold us. I needed her, felt bad for how much I imposed upon her, but I never voiced how much I appreciated or loved her. I took her for granted. Even though she was paid to love us, I know she did. We were her children, especially my youngest brothers. And yet when she moved back home, we lost contact. Was it out of laziness of our own narcissistic lives or was the complexity of our relationship so draining she cut the tie? It is my fear that she thinks we did not return her affection and only thought of her as the maid. I often think about her, we all reminisce about her wondering where she is, and more than anything, I just want to know that she is happy and tell her thank you. It is so strange that someone who is such a vital part of your childhood can just vanish out of your life. \"They say its like true love, good help. You only get one in a lifetime.\" I know. Believe me, I know.The story is strong and real and touched something deep inside me. I could so relate to the motherly love from Constantine to Skeeter, see that pain in the triangle between Aibileen and Mae Mobley and Elizabeth, feel the exasperation of Minny toward Celia, and understand the complexity of the good and bad, the love and hate, the fear and security. Stockett captured all these emotions.I also loved the writing style. When style compliments plot, I get giddy. I don't always love grammatically incorrect prose or books about an author trying to be published, but here it works because it's honest. The novel is about a white woman secretly compiling true accounts of black maids--and the novel is in essence a white author trying to understand black maids. The styles parallel each other as do the messages. The point of Skeeter's novel is to make people see that people are just people no matter the color of their skin and Stockett's novel beautifully portrays that with both good and bad on both sides. The fictional novel cover is decorated with the white dove of love and understanding. To get us there, Stockett gives us three ordinary birds, a picture of ordinary life asking to be accepted for its honest simplicity. This book is Stockett's masterpiece, that story in her that was just itching to get out. From the first page, the voice of the characters took vivid form and became real, breathing people. I loved Aibileen, but think I loved Minny's voice more because she is such a strong character. Besides the maids, I loved Hilly as a portrayal of the white Southern belle with the ingrained belief that black people are not as good as whites, verbalized as \"separate but equal\" so it doesn't sound racist. My favorite scene was when Hilly says they have to be careful of racists because they are out there. She's a bit over the top, but if you've been to the South, not that far of a stretch. I just would have liked to find some redeeming qualities in her from Skeeter's perspective. While there are some instances where I felt Stockett was squeezing historical facts into the novel, forming the plot around these events instead of letting them play backdrop, and occasionally I could read the modern woman in this tale pushing her message too hard, Stockett's sincerity to understand and appreciate shines through. She lived this book to some extent and the story is a part of her. Because it's important to her it becomes important to me. ", "Hey so, while this book and its film adaption have long been favourites of mine I've learnt many things about privilege, racism and white saviourism since I first read this as a teenager. There are quite a few things about how this story came to be that don't sit right with me, hence I've removed my rating and I won't be promoting this any longer. If you want to know more about the reasons for this, google is your friend. The answer won't be hard to find.", "The Kindle DX I ordered is galloping to the rescue today... AND, for all the book purists (which would include me), this is a need, rather than a want. Post-several eye surgeries, I'm just plain sick of struggling to read the words on a page.However, despite the visual challenges, I read all 451 pages of The Help yesterday. Clearly, the book held my interest. However, I spent last night pondering why the book wasn't as good as my nonstop reading would indicate.What was wrong? Most of all, I think it was the book's ambivalent tone. In brief, a white woman, Miss Skeeter Phelan--one of Jackson, Mississippi's socially elite--convinces a number of the African-American maids to tell her their story. What goes on in the homes of the upper crust? How do these women really treat their maids? Though the book would be published anonymously and no locations would be given, the stories provide enough detail so that the premise (that the book could be received as being about Anywhere, USA) defies belief. Further, while having the book's source known might subject Skeeter to social ostracism, this is the 1960s in Missa-fuckin-sippi in the middle of the very tense civil rights' battles. For the maids, discovery would mean loss of a job (with no hope of getting another position) and retribution that could include being falsely accused of a crime (and jailed) or even being injured or killed.Despite the underlying tension and references to violent events that do occur, the book teeters. At times, I was furious and in tears over the effing racism and the tragedies described. But Kathryn Stockett keeps pulling back. It's as though she wants it both ways. Let's divulge the incredible cruelty and violence that black people routinely endured, but let's also show the goodness of some white people and soft-pedal the whole thing into a broader theme, i.e., how difficult it is for two women in any unequal power situation to be \"friends.\"Nope. Sorry. You can't have it both ways. Though some of the women are kinder to their maids, they did not fight against the \"separate but equal\" indignities that included building a \"nigra\" toilet in their home or garage so that the maids' \"nasty\" germs would not infect them, the separate entrances, the substandard schools, the \"justice\" system that made a white accusation the same as proof, and on and on and on.I don't want a book to make me cry and then pull back and say, \"It's all right.\" It's not all right. If you're going to write a book about this horrible time in our history - and in a country where racism is still alive and well - then do it all out. What these women endured deserves more. Don't put it out there and then pull back and use a Doris Day lens. It doesn't work.", "\n  \nThis is one of those few books where people have a polarising opinion. Some loved reading it, while some others detested it.Kathryn Stockett tries to tell us the story of the life of two African American housemaids named Aibileen and Minnie in Mississippi. The racism and rejection they had to face in their life and how they faced it with courage form the crux of this story. Even though the character creation of Skeeter by Stockett has some cliches, we will still like the way the author crafted this story due to the way she unravels the complex plot enmeshed with various themes with a Surgeons precision. I loved the way the author made sure that this novel never becomes pedantic or preachy in any place. I also equally loved watching the silver-screen version of this book. Some of the events mentioned in this book have the propensity to disconcert you to a certain extent. Still, I can easily say that this is one of those rare books that you should never miss.—————————————————————————\n  You can also follow me on \n  Instagram ID - Dasfill  |  YouTube Channel ID - Dasfill  |  YouTube Health Channel ID - Dasfill - Health  |  YouTube Malayalam Channel ID - Dasfill - Malayalam   |  Twitter ID - Dasfill1  |  Snapchat ID - Dasfill  |  Facebook ID - Dasfill  |  TikTok ID - Dasfill1 ", "\"I know what a froat is and how to fix it.\" Aibileen Clark knows how to cure childhood illnesses and how to help a young aspiring writer write a regular household-hints column for the local paper. But she's struggling mightily to deal with grief over the death of her 20-something son, and she SURE doesn't think conditions will ever improve for African-American domestic-engineering servants in early-1960s Jackson, Mississippi or anywhere else in the South. Aibileen's good friend Minny has been a maid since she was very young, and on the first day of her first job her mother admonished her that sass-mouth, especially her degree of it, is highly dangerous--but it's not long before she's just gotta mouth off....and look for another job. As Minny's first \"episode\" of the book opens, she is yet again looking for a new job, and this time an opportunity pretty much falls into her lap. Celia Foote needs a domestic engineer, but she also needs a friend, a real ally, even a confidante. Oh, one more thing: she needs to keep Minny a secret, at least for a while. I think this plotline was my favorite part. Celia's husband had formerly gone with (even been engaged to?) somebody else; did any of you wonder how they would have gotten along if he had married her instead of Celia?But, really, which is the worse attack from Minny: a good sass-mouthin' or a good slice of her extra-special chocolate revenge pie?Thanks for reading.", "enthusiasm!!! this book and i almost never met. and that would have been tragic. the fault is mostly mine - i mean, the book made no secret of its existence - a billion weeks on the best seller list, every third customer asking for it at work, displays and reviews and people on here praising it to the heavens. it practically spread its legs for me, but i just kept walking. i figured it was something for the ladies, like sex and the city, which i don't have to have ever seen an episode of to know that it's not something i would enjoy. i figured that this book was on the ladder one rung above chick lit. so i am to blame for my snobbish dismissiveness, but have you seen this cover?? what is with that sickroom color scheme? and i hate those stupid little birds. what is chip kidd so busy doing that he can't just pop over here and lend a hand?? it is not my fault for thinking it was a crappy book when that cover wanted me to think it is a crappy book.but this book is good. really, really good. again, i thank you, readers' advisory class, for fixing me up with this book. it has been a long time since i have read such a frankly entertaining book. (if a book about the emotionally-charged early days of the civil rights movement can be called entertaining.) this is just an effortlessly told story, split between three different women, whose voices and perspectives never run together - the secondary characters are also completely believable and are all different brands of repellent, with some token sympathetic characters tossed in for the halibut. i don't even know what to say, i just feel all \"aw, shucks, i loved this book\" about it - there were several times i would catch myself grinning at a turn of phrase or a situation, and every time i would start to doubt myself, that maybe i would like sex and the city. or buffy the vampire slayer  or all these things i have formerly judged without having read/seen/eaten. maybe i am like these white women in the book, taking their help for granted and assuming they have nothing to say to each other because of their unwillingness to talk to them and know them as human beings. maybe buffy and i have so much to learn from one another...then i would snap out of it and remember that my gut opinions are 99.99% foolproof. so for you other people, who need to be swayed by hype - i give you hype. this book's hype is merited - it would be a perfect book to read this summer when you are melting from the sun and need a good story.. this is a very tender and loving book, about hope and sisterhood and opportunity, but also about beatings and terror and shame.still hate those birds, though.come to my blog!", "The Help is a tale of lines, color, gender and class, in the Jackson, Mississippi of the early 1960s. This is a world in which black women work as domestics in white households and must endure the whims of their employers lest they find themselves jobless, or worse. It is the Jackson, Mississippi where Medgar Evers is murdered, and where spirit and hope are crushed daily. It is the Jackson, Mississippi where Freedom Riders are taken from a bus, a place where segregation and racism are core beliefs and where challenge to the status quo is met with resistance, to the point of violence. It is a time of political turmoil on the national stage, as the civil rights movement is picking up steam. It is also a place where using the wrong bathroom could get a black person beaten to death. Kathryn Stockett -image from The Telegraph The Help sees this world through three sets of eyes, Aibeleen, a fifty-something black woman who has taken care of many white children and is beginning again with a newborn. Minny, in her thirties, has troubles enough at home, with an abusive, drunken husband and several children of her own, but her inability to control her tongue has led to a series of jobs and a series of firings. Skeeter is a young white woman, newly graduated from college, and eager to pursue a career in writing. Skeeter has grown a conscience and no longer accepts the presumptions of the past. She yearns to know what happened to Constantine, the black woman who was so important to her as a child. Skeeter sees the unfairness of the social structure. She engages Aibeleen, Minny and a host of other black domestic workers to tell their stories for a book, hoping to expose the hypocrisy and cruelty of Jackson’s white society. The story not only places the events in historical context, but offers a taste of what it must have been like for the Aibeleens, Minnys and Skeeters of the time. Stockett has created living, breathing characters, people you can relate to, cheer and cry for. If there is softness here, it is that the devils are painted in glaring red, which may be an accurate portrayal of the time, but makes for a melodramatic feel at times. The heroines are fully realized. We get a sense of how they came to be the way they are. While we are offered some background on the baddies, it is not enough to make them as completely human as the three narrators. The Help is a powerful, moving read, blessed with a colorful, believable cast of characters, a compelling setting and an eternal message of shared humanity, a knockout of a first novel.=============================EXTRA STUFFStockett's Twitter and Goodreads pagesThere is a website with her name, but it has been hijacked by a Japanese entity. The last entry on her FB page is from 2010.", "ive had unpopular opinions about books in the past, but when its about a story that covers very sensitive and important topics, i feel especially guilty. i am not sure what it is exactly that rubbed me the wrong way, but i just couldnt fully support this book. the writing was fine and the characters are decent. but when a story discusses such heavy and often uncomfortable subjects, i want to feel strong emotions. but right now im only feeling mild concern.and the question that keeps bothering me is, is this KSs story to tell? just because an author can write a story, does that mean they should? i think when it comes to telling a story that is inherently sensitive, much more consideration needs to be taken than usual. and i am starting to think KSs experience as a white woman may have unconsciously led her to stray from the story she was trying to achieve. this feels very full of racial stereotypes and i couldnt help but see skeeter as someone to be praised for her white-saviour complex. i believe the intentions behind this story are good ones. i appreciate that themes like societal pressures, bullying, and job dissatisfaction are relevant to today. i also appreciate that this story has helped readers empathise with the struggle against racial inequality. but for being a story about ‘the help,’ this sure felt a lot like it was really about skeeter getting her dream job and all the drama in the white ladies debutante club. i dunno. maybe im reading too much into this and im trying to be too politically correct when i really should have just enjoyed a good story. regardless, im still a little disappointed by this. ↠ 3 stars", "The Help, Kathryn StockettThe Help is a 2009 novel by American author Kathryn Stockett. The Help is set in the early 1960's in Jackson, Mississippi, and told primarily from the first-person perspectives of three women: Aibileen Clark, Minny Jackson, and Eugenia \"Skeeter\" Phelan. Aibileen is a maid who takes care of children and cleans. Her own 24-year-old son, Treelore, died from an accident on his job. In the story, she is tending the Leefolt household and caring for their toddler, Mae Mobley. Minny is Aibileen's friend who frequently tells her employers what she thinks of them, resulting in her having been fired from nineteen jobs. Minny's most recent employer was Mrs. Walters, mother of Hilly Holbrook. Skeeter is the daughter of a white family who owns a cotton farm outside Jackson. Many of the field hands and household help are African Americans. Skeeter has just returned home after graduating from the University of Mississippi and wants to become a writer. Skeeter's mother wants her to get married and thinks her degree is just a pretty piece of paper. Skeeter is curious about the disappearance of Constantine, her maid who brought her up and cared for her. Constantine had written to Skeeter while she was away from home in college saying what a great surprise she had awaiting her when she came home. Skeeter's mother tells her that Constantine quit and went to live with relatives in Chicago. Skeeter does not believe that Constantine would leave her like this; she knows something is wrong and believes that information will eventually come out. Everyone Skeeter asks about the unexpected disappearance of Constantine pretends it never happened and avoids giving her any real answers. The life Constantine led while being the help to the Phelan family leads Skeeter to the realization that her friends' maids are treated very differently from the way the white employees are treated. She decides that she wants to reveal the truth about being a colored maid in Mississippi. Skeeter struggles to communicate with the maids and gain their trust. The dangers of writing a book about African Americans speaking out in the South during the early 1960's hover constantly over the three women. Eventually, Skeeter wins Aibileen's trust through a friendship which develops while Aibileen helps Skeeter write a household tips column for the local newspaper. Skeeter accepted the job to write the column as a stepping stone to becoming a writer/editor, as was suggested by Elaine Stein, editor at Harper & Row, even though she knows nothing about cleaning or taking care of a household, since that is the exclusive domain of 'the help.' The irony of this is not lost on Skeeter, and she eventually offers to pay Aibileen for the time and expertise she received from her. ...تاریخ نخستین خوانش: روز هفتم ماه آوریل سال 2015میلادیعنوان: خدمتکار؛ نویسنده: کاترین استاکت؛ مترجم: هدیه تقوی؛ تهران، البرز، 1389، در 728ص، شابک 9789644427299؛ موضوع داستانهای نویسندگان ایالات متحده آمریکا - سده 21ممترجم: شهناز کمیلی زاده، کرج، در دانش بهمن، 1390، در 714ص، شابک 9789641741497؛مترجم: شبنم سعادت؛ تهران، فراز، 1391، در 597ص، شابک 9789642434350؛ مترجم: آراز ایلخچویی، نشر آموت، 1391، در 608ص، شابک 9786006605012؛مترجم: نسترن ظهیری، تهران، ققنوس، 1391، در 664ص، شابک 9789643119973؛داستان در میانه ی سده ی بیستم میلادی می‌گذرد، دهه ی شصت سده بیستم میلادی به پایانش نزدیک می‌شود، و زندگی‌ها در هم گره خورده‌ اند: آمریکا تغییر می‌کند، و این تغییرات بیشتر اجتماعی هستند؛ جنگ «ویتنام»، به روزهای سیاه خود نزدیک، و جنبش سیاه‌پوستان، اوج گرفته است، فاصله ی بین نسل‌ها گسترش یافته، و جامعه، در حد و مرز انفجار، قرار دارد؛ در این میان، در ایالت «می‌.سی‌.سی‌.پی (یک ایالت جنوبی و بشدت نژادپرست)» زندگی رنگین‌ پوستان و سفید پوستان، در هم تنیده است؛ داستان در کنار خدمتکارهای رنگین‌ پوست، و خانواده‌ های آنان، در جامعه ی طبقه ی متوسط و ثروتمند سفیدپوست، می‌گذارد؛ رمان ساختار روایتی تکه‌ تکه‌ ای دارد: چند شخصیت کلیدی، هر کدام فصل‌هایی را برای خوانشگر روایت می‌کنند، و این روایت‌ها، در کنار اخبار و گزارش‌هایی که جا به‌ جا درون رمان جای گرفته، به خوانشگر این اجازه را می‌دهد، تا خود تصمیم بگیرد، که در روایت داستانی چه می‌گذرد: آدم‌ها می‌آیند و می‌روند، مکان‌ها دیگر می‌��وند، و از یک ماجرا، تفسیرهای کاملاً دگرگونه عرضه می‌شود، اما ساختار کلی داستانی یگانه است، خدمتکارها، و روزگار آن‌هاست؛همانکه «کاترین استاکت»، در گزارش پایانی خود، بر کتاب می‌نویسند: (با اطمینان می‌توانم بگویم که هیچ‌کس در خانواده ی من، هرگز از «دیمیتری» نپرسیده بود: یک سیاه‌پوست بودن در می‌.سی‌.سی‌.پی، بخاطر کار کردنش برای خانواده ی سفید ما، چه احساسی دارد؛ هرگز به ذهنمان خطور نکرد بپرسیم؛ روال زندگی همین بود؛ چیزی نبود که مردم احساس کنند، لازم ست بررسی و پژوهشکی کنند؛ سال‌ها آرزو می‌کردم کاش آن‌قدر بزرگ، و هوشیار بودم، تا از «دیمیتری» این پرسش ��ا بپرسم؛ وقتی شانزده سالم بود، او مرد؛ سال‌ها، پیش خودم تصور می‌کردم پاسخش چه می‌توانست باشد؛ و به همین خاطر است که این کتاب را نوشتم.)؛ پایان نقلتاریخ بهنگام رسانی 10/08/1399هجری خورشیدی؛ 16/07/1400هجری خورشیدی؛ ا. شربیانی", "I read this book at least 4 years ago, before I began to more consistently use Goodreads... and now I'm going back to ensure I have some level of a review for everything I read. It's only fair... if the author took the time to write it, and I found a few hours to read it... I should share my views so others can decide if it's a good book for them.That said... did anyone not love or like this book? I'll have to check out some other people's reviews... And I wonder how many people just watched the movie... Oh well... I'll keep this review short and not in my usual format, as probably everyone I'm friends with on here has already read it! :)The only reason I'm not giving it a 5 is because I felt like some of the stories needed a better or stronger ending. I truly think it is a fantastic book, and it makes you really think about what happened in the not-so-distant past... and probably still happening in some parts of the country today. Scary thoughts, but in the end, at least the right people got something back they deserved, even if it wasn't as much as it should have been.The characters are very clear and strong. And when there are upwards of 10 to 12 supporting or lead female characters, an author has to spend a tremendous amount of time creating distinct pictures in a readers mind. Stockett did a great job with this task. Each and every one shows you a different personality: leaders and followers, movers and shakers, smart and silly, strong and weak, tolerant and intolerant, thirsty for all the world has to offer and content to stay the same for an entire lifetime.When a writer can shuffle this many people throughout a story, they have invested themselves into the book, the characters, the setting, the theme, the future.I haven't read anything else by this author, but just thinking about this book, and realizing I haven't looked at her other works makes me want to run to her profile now and pick one. Perhaps that's what I'll go do!\n  \n    About Me\n  \nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by.[polldaddy poll=9719251]", "The story itself: This could have really used a better editor. I didn't understand why the boyfriend character was even in there--he added nothing to the story. In addition, Skeeter keeps telling us that Hilly and Elizabeth are her friends but that's just it--she tells us. We never see why she would want to be friends with either of them, Hilly especially. Other characters were equally unbelievable. All the maids are good people and so gracious to Miss Skeeter, save one. Reading their interactions with Skeeter, I was reminded of Chris Rock's bit about old black men: \"I know some of you white people know an old black man--'Oh, Willy at the job--he's so nice!' Willy hates your guts.\" Worst of all is the particular characterization of Aibileen. I was going to say that it borders on portraying her as a Magical Black Person because I didn't think she had magical powers, but then I remembered the part about how her fellow church members think her prayers are more powerful than others'. The premise: Before reading, my question was, can Kathryn Stockett write this story? I read the whole book. I read the self-conscious afterword. Can Stockett write this story? Well, of course she can. But should she? I lean toward no. This is not her story to tell. I was reminded of Lo's Diary and how Pia Pera said that she thought of a part in Lolita as an invitation to a a literary tennis match and so she had to write it and no, you didn't. And neither did Kathryn Stockett. She said that she wrote this book because it'd never occurred to her what her maid Demetrie's life was like. So she made up the story. And it was still all about the white lady. ", "I don't think this could be any more obvious, trite and cliche-ridden. The book's only aim is to make white people feel better about themselves (you know, that same old a-brave-white-lady-savior story you've read and a few dozen times before). Guess it worked. Again. ", "Posted at Shelf Inflicted One of my co-workers, a guy who isn’t much of a reader, borrowed The Help from the library based on his English professor’s recommendation. The guy just couldn’t stop talking about the story, so I decided to borrow the audio book. It’s not very often I get to discuss books with people in real life and I wasn’t going to let this opportunity slip by. Audio books are good for me. I was so engrossed in the story and characters that I drove the speed limit on the highway and took the scenic route while running errands. Sometimes I went out at lunch and needlessly drove in circles, or sat in the parking lot at work, waiting for a good place to stop. It is 1962 in Jackson, Mississippi. Twenty-two year-old Eugenia “Skeeter” Phelan has returned home after graduating college to find that Constantine, her family’s maid and the woman who raised her, has mysteriously disappeared. Aibileen is a black maid in her 50’s who works for the Leefolt family and cares deeply for their daughter, Mae Mobley. She is still grieving for her young son, who died in a workplace accident. Minny is Aibileen’s closest friend and a wonderful cook, but her mouth keeps getting her into trouble and no one wants to hire her, until Aibileen helps secure her a position with Celia Foote, a young woman who is new in town and unaware of Minny’s reputation. The story jumps back and forth between the three characters, all of them providing their version of life in the South, the dinner parties, the fund-raising events, the social and racial boundaries, family relationships, friendships, working relationships, poverty, hardship, violence, and fear. Skeeter’s mother wants her to find a nice man and get married, but she’s more interested in changing the world. Her plans to anonymously compile a candid collection of stories about the maids’ jobs and the people they work for will risk her social standing in town, her friendships, and the lives of the maids who tell their stories. I loved this story! The characters really came alive for me, and the author did a good job acknowledging actual historical events which lent richness and authenticity to the story. I laughed and cried, felt despair and hope. This is an important story that is a painful reminder of past cruelty and injustice. It shows how far we have progressed and how much more we still have to accomplish. ", "An amazing book that looks at the relationships between African American housemaids and their White female employers in the early 1960s in the town, Jackson, in Mississippi. The book is written by a White woman from Mississippi. A book that made me cry with anger, with sorrow, but aslo with wonder and laughter. A fantastic work from first time published author, Kathryn Stockett! A book that is not as full of anger and pain as it could have been; and in my opinion, it is exactly that, that makes it such an original and enjoyable read? 11 out of 12 = Five Star Read", "This is an amazing and moving novel. So much so that tasks, appointments, and everything else in my life were put on hold while I read, laughed, cried, celebrated, hurt, and felt healed. Some friends once told me about a spiritual teacher who would often say, “There is magic in the telling”. The truth in those words vibrates throughout this brilliantly conceived and executed novel.The author herself talks about the risk of a white woman telling the stories of black women living in an era of slow transition between overt, undisguised racism and a more covert and secretive racism. Yet, many white people of that time did not recognize racism for what it was: the structure of society was simply their everyday life. As long as the black people needed the jobs offered by white society, they would be subject to obeying every command, swallowing frustration, anger, and their own pride – and usually for much less than minimum wage. The consequences of not swallowing were just too dangerous.This novel, a book about writing a book about the domestic service of black women in early 1960’s Mississippi is a finely balanced, on-the-edge story – like a tightrope walker dozens of feet above Niagara Falls. One slip, one false step, and the entire premise would collapse into the water.Instead, there is a rare and precious authenticity to these stories that are thematically pulled together by Skeeter - the white woman determined to write the book, and Aibileen – the black domestic worker employed by one of Skeeter’s friends. And then there is Minny. Rebellious, full of anger, intelligent, wise, and good - how she was able to cope with a home life filled with conflict and carry on working fulltime besides is beyond me.My admiration for so many of these characters started small and continued to build throughout the novel. Their lives, their experiences, their authenticity and humanity touched my soul. I will always be grateful to this beautifully crafted novel for opening my eyes and my heart to a larger perspective.", "“It's true. There are some racists in this town,” Miss Leefolt say.Miss Hilly nod her head, “Oh, they're out there.”Law, this book be good! I’m on tell you how good this book be. Everthing ‘bout this book be good, you gone read this book and you gone see what I’s mean. Law!", "There is a lot to like about this book. It is easy to be drawn in by the storyline and the characters and it’s a pretty fast read. It’s a historical time-period I’ve been really interested, and I thought the portrayal of the events and the relationships were pretty accurately done.The characters are really well done – they’re all pretty different and easy to tell apart, and they’re all so likable in their own real, sometimes prickly ways.And I was impressed by the fairly even-handedness of the topic that Stockett managed. She didn’t make one group out to be saints or one group demons. There are good and bad and goodish-baddish people on every side of the issue, and each has different motivations and reasons for being where they are on that side – hate, pride, naivete, personal experiences.Three reasons why I love The Help:It’s funny. It is not a comedy but some lines just had me wanting to read on and on!It is easy to read. Even though The Help talks about a very serious time in American history, the author really thought about how to write the story in a way that it just flows.I really felt a connection with each of the characters. You get to know them from their point of view. Even though the story is through Miss Skeeter’s mindset for most of the novel, Stockett provides insight into the brain and life of both Minny and Aibileen.", "how do you even discuss the damage this book, completely well-intentioned as it seems to be, has done?i guess i can start this way:the year i turned 12, this book was The Book. sold bajillions of copies, topped best-of lists by critics and media and readers, sold its movie rights. because i was a 10 year old who read everything, and because this book sounded hard but important, i got it for christmas.i read it for the first time that day and cried my eyes out at the ending. i read it a million times more after that, not putting it down for what would ultimately be the last time until i was well into teenagedom. i didn't always answer the question \"what's your favorite book?\" with this, but i sometimes did.in other words, because i had just turned 12 and because i lived in a mostly white area and and because my library selection was well-meaning but white and because i went to a public school where we didn't learn about slavery or jim crow or reconstruction until middle school, and we didn't REALLY learn about it ever, this book, by a white woman, was one of my first encounters with the concept of race.this book, which is about a white woman being better equipped than black women to tell their story twice over, both on-page and off.this book, which serves as an instruction manual for white women on how to use their tears. (an unnecessary one, since we've always been fairly good at that, but one all the same.)this book, of white saviordom and of black women as background and as supporting characters to white protagonists and as both nannies and mothers but only one role matters to the story. this book, in which black women speak in dialect and white women (even the \"white trash\" ones) speak in unaccented grammatically perfect english. this book, which begins and ends in the 1960s and yet is feel-good above all, attempting a \"we're all people!\" happy tone that ignores privilege and racism and what is to come in order to try on the kind of color-blind belief system that eases the existences of white people everywhere. this book, an account of black women losing their jobs and livelihoods and white women becoming what they always dreamed of being. how to begin to undo the impact this story had on my brain?this is part of a series i'm doing in which i review books i read a long time ago and reveal my addiction to getting yelled at in comments", "Kathryn Stockett has created this wonderful story that depicts life in America’s South during the early 1960s. A mix of humour and social justice, the reader is faced with a powerful piece on which to ponder while remaining highly entertained. In Jackson, Mississippi, the years leading up to the Civil Rights Movement presented a time where colour was a strong dividing line between classes. Black women spent much of their time serving as hired help and raising young white children, while their mommas were playing ‘Society Lady’ as best they could. Eugenia “Skeeter” Phelan may have been part of the clique, born with a silver spoon in her mouth, but she held herself on the periphery, at times looking in. Skeeter was unwed and with few prospects, though her time away at college left her ready to tackle the workforce until an eligible man swept her off her feet. Skeeter returned to Jackson, only to find her family’s help left under mysterious circumstances and no one was willing to discuss it. Skeeter sought a job as a writer, prepared to begin at the bottom rung, but not giving up on sleuthing around to determine what might have been going on in Jackson. Skeeter scored a job writing an informative column in the local newspaper, giving cleaning tips to housewives in need of a little guidance. Who better to offer these tips that the hired help of Jackson?! Skeeter fostered a slow friendship with one, while building up a trust, and has an idea for a book that could offer a unique perspective in Mississippi’s divided society. Skeeter sought to write a tell-all from the perspective of the hired help, in hopes of shining a light on the ongoing domestic slavery taking place within a ‘freed’ America. With secret meetings taking place after working hours and Skeeter typing away, a mental shift took place and the idea of class became taboo, at least to some. Full of confessions and struggles in Mississippi society, Skeeter’s book may just tear the fabric of what has been a clearly demarcated community since after the Civil War. However, sometimes a book has unforeseen consequences, turning the tables on everyone and forcing tough decisions to be made. Stockett pulls no punches in the presentation, fanning the flames of racial and class divisions, as she depicts a way of thinking that was not only accepted, but completely sanctioned. A must-read for anyone ready to face some of the treatment undertaken in the name of ‘societal norms’, Stockett tells it like it was… and perhaps even still is!Race relations in the United States has long been an issue written about, both in literature and pieces of non-fiction. How a country as prosperous as America could still sanction the mistreatment of a large portion of its citizens a century after fighting a war on the issue remains completely baffling. While Stockett focusses her attention on Mississippi, the conscious reader will understand that this sort of treatment was far from isolated to the state. One might venture to say that racism continued on a worldwide scale, creating a stir, while many played the role of ostriches and denied anything was going on. The characters within the book presented a wonderful mix of society dames and household help, each with their own issues that were extremely important. The characters bring stereotypes to life in an effort to fuel a raging fire while offering dichotomous perspectives. The interactions between the various characters worked perfectly, depicting each group as isolated and yet fully integrated. The household help bring the struggle of the double work day (triple, at times) while the society dames grasp to keep Mississippi from turning too quickly towards integration and equality, which they feel will be the end of all normalcy. Using various narrative perspectives, the characters become multi-dimensional. Additionally, peppering the dialogue with colloquial phraseology pulls the story to a new level of reality, one that is lost in strict textbook presentation. Stockett pushes the narrative into those uncomfortable places the reader hopes to keep locked in the pages of history, pushing the story to the forefront and requiring a synthesising of ideas and emotions. This discomfort is the only way the reader will see where things were, likely in a hope not to repeat some of history’s worst moments in America’s development. However, even fifty years after the book’s setting, there remains a pall of colour and class division promulgating on city streets. While racism is not as sanctioned in as many laws, it remains a strong odour and one that cannot simply be washed away by speaking a few words. This book, as entertaining as it is in sections, is far from fictional in its depiction of the world. The sooner the reader comes to see that, the faster change can occur. All lives matter, if we put in the effort and have the presence of mind to listen rather than rule from our own ivory towers.Kudos, Madam Stockett for this wonderful piece. I am happy to have completed a buddy read on this subject and return to read what was a wonderful cinematic presentation.Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/", "This is a historical fiction book about what it is like being a black woman in the South in the 1960's. This book follows a black maid mainly. As a white woman that grow up in the South I know things like this happen, but it makes me very sad. This is a great book that I did not want it to end because I wanted to keep reading about these characters. I could not put it down. I love this book so much. I listen to this book on audiobook, and the audiobook was so great. I also watch the movie base off this book, and it was also very good. I think if you like historical fiction book you should read this book. (*)", " Servility This is a book that delivers on several levels: it is an entertaining and engrossing novel with drama, humour and sadness, but it also causes us to reflect on deeply moral and racial issues. While racism has existed for a long time and continues to unfold, the story provides a snap-shot into a time that is fascinating and how historically it manifested itself into society in the US. It’s a story of how servants or maids show more integrity and moral compass than their employers. It’s a story of life and communities: how we love and hate, how we laugh and cry, how we interact with family, friends and those we work with/for.The narrative in The Help places the perspective from a white journalist, Miss Skeeter, and two black maids, Aibileen and Minny. Miss Skeeter wants to write a book using the insights both Aibileen and Minny as to what it's like to be a maid and how they are treated. This causes major concerns of trust, if they are to be open and truthful, as Minny says.\n  “I can't believe Aibileen wants to tell Miss Skeeter the truth.Truth.It feels cool, like water washing over my sticky-hot body. Cooling a heat that's been burning me up all my life.Truth, I say inside my head again, just for that feeling.”\n Each character is very well developed with more than just a superficial front and they show depth to the many aspects of their lives. There are other books that cover slavery, segregation and racism in the US, many are more sensational and brutal in their coverage of black subjugation, however, this book leads us to those issues in a less graphic manner for a more mainstream international audience. The stories and insights in themselves are inspiring and understanding the paradox where someone like Aibileen can be trusted to raise white children but watched suspiciously in case she steals material items, is bizarre. How maids must remain upbeat and pleasant regardless of the way they’re treated or what may be happening within their own families and personal lives. To hold the quality of someone’s life as a weapon is corrupt and repulsive, but to do it on a systemic scale is completely abhorrent.The Help is a very clever book, perhaps meant for more global audiences as it provides an entertaining story whilst delivering these deep ethical issues. I highly recommend this book.", "1.24.2020 update:Whew I originally read this book when I was in high school and wow did I lack racial awareness then. I left my original five-star review below, though now I recognize that there are a lot of problems with a white woman portraying the south in this way. Here's a link to an article that explains this with a good amount of depth, featuring the perspective of Viola Davis: https://www.telegraph.co.uk/films/201...Here's a concise Goodreads review I'd recommend checking out: https://www.goodreads.com/review/show...Original review:Originally, I thought this book should have been retitled The Hype. At least that's what I told my friend. I remember thinking something along the lines of, blah, another story about racism in the old southern days? Must be the chick-lit version of To Kill a Mockingbird. Wow. I was so wrong.The Help details the lives of three women living in Jackson, Mississippi, right when the Civil Rights Movement began. There is Skeeter, a twenty-two-year-old aspiring writer who terribly misses her maid, Constantine. Aibileen is an experienced and knowledgeable black maid who is currently taking care of her seventeenth child, Mae Mobley, even though she realizes what's at stake for both of them. And Minny is a fierce, sassy cook who doesn't take nonsense from anyone, even when it risks her employment. This tumultuous trio takes the first step in sparking a movement that will ignite fire to the racism and hypocrisy of their small town.My synopsis of the story probably isn't even a tenth of the merit it deserves. I don't want to spoil too much about the book, but the most amazing thing about The Help is its characters. They are so real, so lifelike, I could feel their thoughts pulsing through my head and their emotions racing through my veins. I was angry alongside them, cheered for them, and cried with them.I think everyone should read this book, especially people who are ignorant about the racism and hypocrisy that still manages to plight everyday society. The Help wasn't just a darn good read, but something that has made me reevaluate and examine my own morals. I'll never forget it.Want to read more of my reviews? Follow me here.", "So, it looks like THE HELP is turning out to be one of those novels that I love despite flaws. Nearly everyone in the world knows what this book is about (as I pen this review, it is at #2 in Amazon sales ranking) but I shall reiterate: it’s the story of three women -- two black, one white -- in 1960s Jackson, Mississippi, and how the two black maids work with the one extremely naive white young woman to write a book of their stories as “the help.” In the spirit of honesty, I should tell you that I didn’t want to read it. It sounded like it was going to hit the Maggie Trifecta of Doom:1) Fiction that is Good for You2) “Women’s Fiction”, now with 60% more tears3) Mint Julep references* *I have not been thrilled by a single novel that mentions a mint julep. I’m not sure if this is coincidence. However, I loved it. Despite the fact that the book is massive -- pick it up next time you go by, it’s a doorstop -- I read it in three evenings. It was engrossing, very well characterized and often funny. Strangely enough, two of those are also part of what I consider its flaws. The characters are so reliably themselves that they are nearly caricatures in some areas. While it meant I could definitely never mistake one woman’s voice for another, it also gave it a bit of a Hollywood/ sitcom feel; they were types instead of people. And the funny -- well, race relations in ‘60s Mississippi is not exactly all fun and mint juleps, as everyone knows. But this book is upbeat, uplifting, and ultimately made a bit fluffy by all its humor and optimism. Again, I could imagine this as a Hollywood screenplay in a New York minute. Still, don’t get me wrong -- it’s wonderfully written and easy to love and very easy to recommend. I also think it would be a killer book club book, because there is a lot to talk about in here, and I don’t just mean the Trifecta of Doom bits. I think that everyone who reads it will at least like it, even if it will not become their absolute favorite in the world. And we need books like that. So go out and read it.***wondering why all my reviews are five stars? Because I'm only reviewing my favorite books -- not every book I read. Consider a novel's presence on my Goodreads bookshelf as a hearty endorsement. I can't believe I just said \"hearty.\" It sounds like a stew.***", "\n“These is white rules. I don’t know which ones you following and which ones you ain’t.”We look at each other a second. “I’m tired of the rules,” I say.-p.155The Help spins the tales of women of color who worked as housekeepers in Louisiana in the early 1960’s, as told to Skeeter who will chronicle their stories and publish them anonymously in one volume. Her naiveté is shattered when she realizes the back-breaking labor these women do and some of the conditions with which they must endure to make ends meet. The way she looks at her family and friends will forever be changed as she embarks on this project.\nI shake my head at my friend. “Not only is they lines, but you know good as I do where them lines be drawn.”Aibileen shakes her head. “I used to believe in em. I don’t anymore. They in our heads. People like Miss Hilly is always trying to make us believe they there. But they ain’t.”-p.312The audience perspective is not limited to the outsider looking in with Skeeter; Aibileen and Minny provide much needed commentary on what their lives and jobs are like. It’s an important bit of storytelling to show their sides and tell their stories. Though, as a reader, I would have loved to see Constantine’s version of the events as well.The main antagonist, Hilly, is bored and power-hungry. She is a sweetly manipulative queen bee whose peers are outgrowing their need to be cajoled into doing her bidding. That time of her life is well behind her so she decides to use pseudo science and arm-twisting to retain her delusion of social status by trying to convince everyone that they need a separate bathroom for their colored help. She ends up talking so much shit that she ends up having to eat her words…The Help is entertaining if not languidly paced. I was left wanting more—more of the story, more of these women’s lives, and more of Minny’s tale of revenge upon a certain housewife.", "This is a powerful story about women's relationships with each other, and how they are affected by race (and class), told from the viewpoints of three women (two black maids and a young white woman). It is set in segregated Jackson, Mississippi, in 1962-64, at the dawn of the civil rights movement, but it's local and domestic, rather than looking at the big picture.The first third of the book establishes the main characters and their situation and relationships; the rest of it revolves around a dangerous plan to write about their lives: it ends up reading as if it's a book about how this book was created (though the notes at the end make it clear that it isn't). It is a novel about individuals, and makes no pretence of being a history of the civil rights movement, but given the subject matter, it arouses strong feelings (see below, including comments, for some of the reasons). Passions run high in those with direct experience or detailed knowledge of racial issues in the US. My comments are the reaction of a fairly ignorant outsider.For a deeper, more complex, and educational (for me) way of looking at the legacy of slavery on race relations, see Octavia Butler's Kindred, review here.IT'S ABOUT MOTHERING AND AWAKENING AS MUCH AS RACEAlthough it might appear that the main relationships are between employer and help, mothering and displaced mothering is in many ways a stronger theme. It's also about other relationships, especially between women: bitchy cliques, friendships made and broken, fear versus collusion. Husbands don't generally come out of it well.There is an awkward pact involved for white mothers: letting your children be raised by members of a race you despise versus raising the children of your oppressors. As Skeeter says, \"They raise a white child and then 20 years later the child becomes the employer. It's that irony that we love them and they love us, yet we don't even allow them to use the toilet in the house\". There are opportunities to sway young minds (and Aibileen tries especially hard), whilst thinking, \"Baby Girl, who I know, deep down, I can't keep from turning out like her mama\". The maids' jobs and colour also have a negative effect on their own mothering. Not only do some of the white children feel the help loves them more than their own mothers; in some cases they are right, and that causes other tensions and problems. Yet firing the help is not always an option: \"the help always know\" all the secrets.The three main characters are very strong women, and each gradually finds the strength to follow her conscience, despite the personal risks, to the point where Skeeter realises \"I no longer feel protected because I am white\". They learn, grow, awaken, and take some control over the future. However, if I were an African-American, or raised in the deep south, I'm sure these aspects would seem much less significant in comparison to the race theme.AUTHENTICITY?When I read this, I had no idea how accurate any of it is (I have subsequently learned of many doubts), but in terms of individual relationships, it rings true to this Brit, especially the different voices through which the story is told. It was also interesting that the maids were so used to \"the lines\", that they disliked it when they were crossed, e.g. by an employer who was too friendly: \"She just don't see 'em. The Lines. Not between her and me, not between her and Hilly\". Yet the maids train their own children into subjugation by teaching the rules \"for working for a white lady\". This has strange effects: \"I don't know what to say to her. All I know is, I ain't saying it. And I know she ain't saying what she want a say either and it's a strange thing happening here cause nobody saying nothing and we still managing to have us a conversation\".On the other hand, it seems improbable that all the powerful white women in the town are only in their mid 20s. I presume that was necessary because they needed to be contemporaries of Skeeter, and she needed to be young, but it still made me question the story in broader terms.SYMPATHIESOne expects to have strong sympathies for the maids, but a couple of the white women (including Skeeter) have a hard time (not as hard as the maids, though): material privilege, but they don't fit into either world. That creates a tension in the reader that is quite powerful.The saddest white person is the little girl Aibileen cares for; she is a misfit in her own home, because her mother never bonded with her, \"She like one a them baby chickens that get confused and follow the ducks around instead\". Aibileen tries hard to compensate, particularly by repeating the mantra \"You kind, you smart, you important\". Mind you, she also sows the seeds future disagreement with her parents by telling secret stories about a kind alien visitor called Martian Luther King who thinks all people are the same, and by wrapping identical sweets in different coloured wrappers to make the same point. \"I want to stop that moment from coming - and it comes in ever white child's life - when they start to think that coloured folks ain't as good as whites.\"STEREOTYPESAlthough the book fits with some stereotypes (e.g. the hideous contradiction of raising money for starving Africans whilst campaigning for outside loos in all white homes, lest the owners catch black diseases), it certainly confounds others, both in the minds of some of the characters and, to a lesser extent, to the readers (e.g. many of the maids are more educated than might be expected and Aibileen is an keen and excellent writer). As Skeeter says, \"The dichotomy of love and disdain living side by side is what surprises me\", and that was the core of the book for me.LANGUAGE, DIALECT and DIFFERENT VOICESFrom the very first sentence, you are aware of Aibileen's voice and dialect, \"on a early Sunday\". She is an ageing maid who cares for white children when they are young, then moves on. Her own son died in an industrial accident at 24 and from then \"A bitter seed was planted inside me. And I just didn't feel so accepting any more\". Is this dialect accurate, patronising appropriation, or both?Minny is the other black voice: a maid and church friend of Aibileen's, but with a young family and violent husband. She speaks her mind, so has often been fired.The final voice is Skeeter, the daughter of a plantation owner who has returned from college and is shocked to discover that the beloved maid who raised her has gone, and no one will tell her why.OTHER IRRITATIONS* My knowledge of US history is scanty and I didn't know when it was set until page 22, though even then I was only able to work it out by looking up Stevie Wonder's year of birth.* Despite being initially vague about the date, some subsequent mentions of period detail seem rather forced, e.g. \"To Kill a Mockingbird\", Rosa Parks and Bob Dylan. It should have been possible to mention them in a more natural way.* Did anyone say they needed \"space\" and \"time\" away from a relationship in Mississippi in 1963?"]}
]